Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
  preferences.end();

  Serial.println("\n📊 Loaded Calibration Data:");
  Serial.printf("   pH - Slope: %.4f, Offset: %.3f, Points: %d, Calibrated: %s\n",
                ph_cal.slope, ph_cal.offset, ph_cal.num_points,
                ph_cal.is_calibrated ? "YES" : "NO");
  Serial.printf("   TDS - Slope: %.4f, Offset: %.2f, Points: %d, Calibrated: %s\n\n",
                tds_cal.slope, tds_cal.offset, tds_cal.num_points,
                tds_cal.is_calibrated ? "YES" : "NO");
}


// ============================================================
//  Save calibration data to Preferences
// ============================================================
void saveCalibrationData() {
  preferences.begin("calibration", false);

  // Save pH calibration
  preferences.putFloat("ph_slope", ph_cal.slope);
  preferences.putFloat("ph_offset", ph_cal.offset);
  preferences.putBool("ph_cal", ph_cal.is_calibrated);
  preferences.putInt("ph_points", ph_cal.num_points);
  preferences.putFloat("ph_p1_v", ph_cal.point1_voltage);
  preferences.putFloat("ph_p1_ph", ph_cal.point1_ph);
  preferences.putFloat("ph_p2_v", ph_cal.point2_voltage);
  preferences.putFloat("ph_p2_ph", ph_cal.point2_ph);
  preferences.putFloat("ph_p3_v", ph_cal.point3_voltage);
  preferences.putFloat("ph_p3_ph", ph_cal.point3_ph);
  preferences.putFloat("ph_coeff_a", 0.0);
  preferences.putFloat("ph_coeff_b", 1.0);
  preferences.putFloat("ph_coeff_c", 0.0);

  // Save TDS calibration
  preferences.putFloat("tds_slope", tds_cal.slope);
  preferences.putFloat("tds_offset", tds_cal.offset);
  preferences.putBool("tds_cal", tds_cal.is_calibrated);
  preferences.putInt("tds_points", tds_cal.num_points);
  preferences.putFloat("tds_p1_v", tds_cal.point1_voltage);
  preferences.putFloat("tds_p1_tds", tds_cal.point1_tds);
  preferences.putFloat("tds_p2_v", tds_cal.point2_voltage);
  preferences.putFloat("tds_p2_tds", tds_cal.point2_tds);

  preferences.end();

  Serial.println("💾 Calibration data saved to flash!");
}


// ============================================================
//  Calculate 3-point quadratic calibration
//  Solves system of equations for: pH = a*V^2 + b*V + c
// ============================================================
bool calculateThreePointCalibration(
  float v1, float ph1,
  float v2, float ph2,
  float v3, float ph3,
  float &a, float &b, float &c
) {
  Serial.println("\n   Calculating 3-point quadratic fit...");

  // Check for duplicate points
  if (abs(v1 - v2) < 0.001 || abs(v2 - v3) < 0.001 || abs(v1 - v3) < 0.001) {
    Serial.println("   ⚠️ Error: Calibration points too close!");
    return false;
  }

  // Using Lagrange interpolation formula for quadratic
  // More numerically stable than solving matrix equations

  float v1_sq = v1 * v1;
  float v2_sq = v2 * v2;
  float v3_sq = v3 * v3;

  // Calculate determinants using Cramer's rule
  float denom = (v1 - v2) * (v1 - v3) * (v2 - v3);

  if (abs(denom) < 0.0001) {
    Serial.println("   ⚠️ Error: Points are collinear!");
    return false;
  }

  // Coefficient a (quadratic term)
  a = (ph1 * (v2 - v3) + ph2 * (v3 - v1) + ph3 * (v1 - v2)) / denom;

  // Coefficient b (linear term)
  b = (ph1 * (v3_sq - v2_sq) + ph2 * (v1_sq - v3_sq) + ph3 * (v2_sq - v1_sq)) / denom;

  // Coefficient c (constant term)
  c = (ph1 * (v2 * v3_sq - v3 * v2_sq) +
       ph2 * (v3 * v1_sq - v1 * v3_sq) +
       ph3 * (v1 * v2_sq - v2 * v1_sq)) / denom;

  Serial.printf("   a = %.6f (quadratic)\n", a);
  Serial.printf("   b = %.6f (linear)\n", b);
  Serial.printf("   c = %.6f (constant)\n", c);

  // Verify the fit by checking all three points
  float error1 = abs((a * v1_sq + b * v1 + c) - ph1);
  float error2 = abs((a * v2_sq + b * v2 + c) - ph2);
  float error3 = abs((a * v3_sq + b * v3 + c) - ph3);

  Serial.printf("   Fit errors: %.4f, %.4f, %.4f pH\n", error1, error2, error3);

  if (error1 > 0.01 || error2 > 0.01 || error3 > 0.01) {
    Serial.println("   ⚠️ Warning: Large fitting errors detected!");
  }

  return true;
}


// ============================================================
//  Calculate two-point calibration (slope & offset)
// ============================================================
void calculateTwoPointCalibration(
  float v1, float val1,   // First point (voltage, value)
  float v2, float val2,   // Second point (voltage, value)
  float &slope,           // Output: calculated slope
  float &offset           // Output: calculated offset
) {
  // Avoid division by zero
  if (abs(v2 - v1) < 0.001) {
    Serial.println("⚠️ Warning: Calibration points too close, using default");
    slope = 1.0;
    offset = 0.0;
    return;
  }

  // Calculate slope: (y2 - y1) / (x2 - x1)
  slope = (val2 - val1) / (v2 - v1);

  // Calculate offset: y = slope * x + offset  →  offset = y - slope * x
  offset = val1 - (slope * v1);

  Serial.printf("   Calculated Slope: %.4f\n", slope);
  Serial.printf("   Calculated Offset: %.4f\n", offset);
}


// ============================================================
//  Convert raw ADC to voltage
// ============================================================
float rawToVoltage(int raw_adc) {
  return (raw_adc / ADC_RESOLUTION) * VREF;
}

// ============================================================
//  Read raw ADC value with averaging
// ============================================================
float readADCAverage(int pin, int samples) {
  long sum = 0;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(pin);
    delay(SAMPLE_DELAY);
  }
  return (float)sum / samples;
}

// ============================================================
//  ★ IMPROVED pH CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float convertToPH(int raw_adc) {
  // Convert ADC to voltage
  float voltage = rawToVoltage(raw_adc);

  // Base pH calculation (theoretical)
  float ph_base = 7.0 - ((voltage - PH_NEUTRAL_VOLTAGE) / PH_VOLTAGE_PER_UNIT);

  // Apply calibration: pH_calibrated = slope * pH_base + offset
  if (!ph_cal.is_calibrated) {
    return ph_base;
  }

  if (ph_cal.num_points == 1) {
    return ph_base + ph_cal.offset;
  }

