Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
  if (ph_cal.num_points == 2) {
    return (ph_base * ph_cal.slope) + ph_cal.offset;
  }

  if (ph_cal.num_points == 3) {
    float v_seq = voltage * voltage;
    return (ph_cal.coeff_a * v_seq) + (ph_cal.coeff_b * voltage) + ph_cal.coeff_c;
  }

  return ph_base;  // Return uncalibrated if not calibrated
}


// ============================================================
//  ★ IMPROVED TDS CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float convertToTDS(int raw_adc, float temperature) {
  // Convert ADC to voltage
  float voltage = rawToVoltage(raw_adc);

  // Temperature compensation
  float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
  float compensationVoltage = voltage / compensationCoefficient;

  // Base TDS calculation (polynomial formula)
  float tds_base = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                    - 255.86 * compensationVoltage * compensationVoltage
                    + 857.39 * compensationVoltage) * 0.5;

  // Apply calibration: TDS_calibrated = slope * TDS_base + offset
  if (!tds_cal.is_calibrated) {
    return tds_base;
  }

  if (tds_cal.num_points == 1) {
    return tds_base + tds_cal.offset;
  }

  if (tds_cal.num_points == 2) {
    return (tds_cal.slope * tds_base) + tds_cal.offset;
  }

  return tds_base;  // Return uncalibrated if not calibrated
}


// ============================================================
//  ★ IMPROVED pH CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibratePH(float known_ph_value) {
  Serial.println("\n🧪 Starting pH Calibration...");
  Serial.printf("   Target pH: %.2f\n", known_ph_value);
  Serial.printf("   Current calibration points: %d\n", ph_cal.num_points);
  Serial.println("   Taking readings...");

  // Read raw ADC (averaged for stability)
  float raw_adc = readADCAverage(PH_PIN, CALIBRATION_SAMPLES);
  float voltage = rawToVoltage((int)raw_adc);

  // Calculate base pH (without calibration)
  float base_ph = 7.0 - ((voltage - PH_NEUTRAL_VOLTAGE) / PH_VOLTAGE_PER_UNIT);

  Serial.printf("   Raw ADC: %.2f\n", raw_adc);
  Serial.printf("   Voltage: %.3f V\n", voltage);
  Serial.printf("   Base pH (uncalibrated): %.2f\n", base_ph);

  // Determine if this is first or second calibration point
  if (ph_cal.num_points == 0) {
    // First calibration point
    Serial.println("   → Setting as calibration point 1");

    ph_cal.point1_voltage = voltage;
    ph_cal.point1_ph = known_ph_value;
    ph_cal.num_points = 1;

    // Simple one-point calibration: just offset
    ph_cal.slope = 1.0;
    ph_cal.offset = known_ph_value - base_ph;
    ph_cal.is_calibrated = true;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.3f\n", ph_cal.offset);

  } else if (ph_cal.num_points == 1) {
    // Second calibration point - enable two-point calibration
    Serial.println("   → Setting as calibration point 2");

    // Check if pH values are different enough
    if (abs(known_ph_value - ph_cal.point1_ph) < 1.0) {
      Serial.println("⚠️ Warning: Calibration points should be at least 1 pH unit apart!");
      Serial.println("   (Recommended: pH 4 and pH 7, or pH 7 and pH 10)");
    }

    ph_cal.point2_voltage = voltage;
    ph_cal.point2_ph = known_ph_value;
    ph_cal.num_points = 2;

    // Calculate two-point calibration
    // Map voltage range to pH range
    calculateTwoPointCalibration(
      ph_cal.point1_voltage, ph_cal.point1_ph,
      ph_cal.point2_voltage, ph_cal.point2_ph,
      ph_cal.slope, ph_cal.offset
    );

    ph_cal.is_calibrated = true;
    Serial.println("   Two-point calibration applied!");

  } else if (ph_cal.num_points == 2) {
    Serial.println("   → Setting as Point 3");

    // Validate: should span a good range
    float min_ph = min(ph_cal.point1_ph, ph_cal.point2_ph);
    float max_ph = max(ph_cal.point1_ph, ph_cal.point2_ph);

    if (known_ph_value > min_ph && known_ph_value < max_ph) {
      Serial.printf("   ⚠️ Warning: Point 3 (%.1f) is between Point 1 and 2!\n", known_ph_value);
      Serial.println("   For best 3-point calibration, use pH 4, 7, and 10");
    }

    ph_cal.point3_voltage = voltage;
    ph_cal.point3_ph = known_ph_value;
    ph_cal.num_points = 3;

    // Three-point calibration: quadratic polynomial
    bool success = calculateThreePointCalibration(
      ph_cal.point1_voltage, ph_cal.point1_ph,
      ph_cal.point2_voltage, ph_cal.point2_ph,
      ph_cal.point3_voltage, ph_cal.point3_ph,
      ph_cal.coeff_a, ph_cal.coeff_b, ph_cal.coeff_c
    );
  } else {
    // First calibration point
    Serial.println("   → Setting as calibration point 1");

    ph_cal.point1_voltage = voltage;
    ph_cal.point1_ph = known_ph_value;
    ph_cal.num_points = 1;

    // Simple one-point calibration: just offset
    ph_cal.slope = 1.0;
    ph_cal.offset = known_ph_value - base_ph;
    ph_cal.is_calibrated = true;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.3f\n", ph_cal.offset);
  }

  // Save to flash
  saveCalibrationData();

  // Test the calibration
  float calibrated_ph = convertToPH((int)raw_adc);
  Serial.printf("   ✅ New calibrated pH: %.2f (target: %.2f)\n", calibrated_ph, known_ph_value);
  Serial.printf("   Error: %.3f pH units\n", abs(calibrated_ph - known_ph_value));
  Serial.println("✅ pH Calibration Complete!\n");

  return true;
}


// ============================================================
//  ★ IMPROVED TDS CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibrateTDS(float known_tds_value) {
  Serial.println("\n🧪 Starting TDS Calibration...");
  Serial.printf("   Target TDS: %.2f ppm\n", known_tds_value);
  Serial.printf("   Current calibration points: %d\n", tds_cal.num_points);
  Serial.println("   Taking readings...");

  // Get water temperature for compensation
  watertemp.requestTemperatures();
  delay(100);
  float temperature = watertemp.getTempCByIndex(0);

