Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
  // Read raw ADC (averaged)
  float raw_adc = readADCAverage(TDS_PIN, CALIBRATION_SAMPLES);
  float voltage = rawToVoltage((int)raw_adc);

  // Calculate base TDS (without calibration)
  float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
  float compensationVoltage = voltage / compensationCoefficient;
  float base_tds = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                    - 255.86 * compensationVoltage * compensationVoltage
                    + 857.39 * compensationVoltage) * 0.5;

  Serial.printf("   Raw ADC: %.2f\n", raw_adc);
  Serial.printf("   Voltage: %.3f V\n", voltage);
  Serial.printf("   Water Temp: %.2f°C\n", temperature);
  Serial.printf("   Base TDS (uncalibrated): %.2f ppm\n", base_tds);

  // Determine calibration point
  if ((tds_cal.num_points == 0) || (tds_cal.num_points == 1) || tds_cal.is_calibrated) {
    // First calibration point
    Serial.println("   → Setting as calibration point 1");

    tds_cal.point1_voltage = compensationVoltage;  // Store compensated voltage
    tds_cal.point1_tds = known_tds_value;
    tds_cal.num_points = 1;

    // One-point calibration
    tds_cal.slope = 1.0;
    tds_cal.offset = known_tds_value - base_tds;
    tds_cal.is_calibrated = true;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.2f ppm\n", tds_cal.offset);

  }
  // else if (tds_cal.num_points == 1) {
  //   // Second calibration point
  //   Serial.println("   → Setting as calibration point 2");

  //   // Check if TDS values are different enough
  //   if (abs(known_tds_value - tds_cal.point1_tds) < 200) {
  //     Serial.println("⚠️ Warning: Calibration points should be at least 200 ppm apart!");
  //     Serial.println("   (Recommended: 0 ppm distilled water and 1330 ppm solution)");
  //   }

  //   tds_cal.point2_voltage = compensationVoltage;
  //   tds_cal.point2_tds = known_tds_value;
  //   tds_cal.num_points = 2;

  //   // Calculate two-point calibration
  //   calculateTwoPointCalibration(
  //     tds_cal.point1_voltage, tds_cal.point1_tds,
  //     tds_cal.point2_voltage, tds_cal.point2_tds,
  //     tds_cal.slope, tds_cal.offset
  //   );

  //   tds_cal.is_calibrated = true;
  //   Serial.println("   Two-point calibration applied!");

  // } else {
  //   // Update existing point
  //   Serial.println("   → Updating existing calibration point");

  //   float dist1 = abs(known_tds_value - tds_cal.point1_tds);
  //   float dist2 = abs(known_tds_value - tds_cal.point2_tds);

  //   if (dist1 < dist2) {
  //     Serial.println("   Replacing calibration point 1");
  //     tds_cal.point1_voltage = compensationVoltage;
  //     tds_cal.point1_tds = known_tds_value;
  //   } else {
  //     Serial.println("   Replacing calibration point 2");
  //     tds_cal.point2_voltage = compensationVoltage;
  //     tds_cal.point2_tds = known_tds_value;
  //   }

  //   // Recalculate
  //   calculateTwoPointCalibration(
  //     tds_cal.point1_voltage, tds_cal.point1_tds,
  //     tds_cal.point2_voltage, tds_cal.point2_tds,
  //     tds_cal.slope, tds_cal.offset
  //   );
  // }

  // Save to flash
  saveCalibrationData();

  // Test the calibration
  float calibrated_tds = convertToTDS((int)raw_adc, temperature);
  Serial.printf("   ✅ New calibrated TDS: %.2f ppm (target: %.2f ppm)\n",
                calibrated_tds, known_tds_value);
  Serial.printf("   Error: %.2f ppm\n", abs(calibrated_tds - known_tds_value));
  Serial.println("✅ TDS Calibration Complete!\n");

  return true;
}


// ============================================================
//  Reset calibration to factory defaults
// ============================================================
bool resetCalibration(const char* sensor_type) {
  Serial.printf("\n🔄 Resetting %s calibration...\n", sensor_type);

  preferences.begin("calibration", false);

  if (strcmp(sensor_type, "PH") == 0 || strcmp(sensor_type, "ALL") == 0) {
    ph_cal.slope = 1.0;
    ph_cal.offset = 0.0;
    ph_cal.is_calibrated = false;
    ph_cal.num_points = 0;

    preferences.putFloat("ph_slope", 1.0);
    preferences.putFloat("ph_offset", 0.0);
    preferences.putBool("ph_cal", false);
    preferences.putInt("ph_points", 0);

    Serial.println("   ✅ pH calibration reset");
  }

  if (strcmp(sensor_type, "TDS") == 0 || strcmp(sensor_type, "ALL") == 0) {
    tds_cal.slope = 1.0;
    tds_cal.offset = 0.0;
    tds_cal.is_calibrated = false;
    tds_cal.num_points = 0;

    preferences.putFloat("tds_slope", 1.0);
    preferences.putFloat("tds_offset", 0.0);
    preferences.putBool("tds_cal", false);
    preferences.putInt("tds_points", 0);

    Serial.println("   ✅ TDS calibration reset");
  }

  preferences.end();
  Serial.println("✅ Reset complete!\n");

  return true;
}


// ============================================================
//  Print calibration status
// ============================================================
void printCalibrationStatus() {
  Serial.println("\n📊 CALIBRATION STATUS");
  Serial.println("========================");

  // pH Status
  Serial.println("pH Sensor:");
  Serial.printf("  Calibrated: %s\n", ph_cal.is_calibrated ? "YES" : "NO");
  Serial.printf("  Points: %d\n", ph_cal.num_points);
  Serial.printf("  Slope: %.4f\n", ph_cal.slope);
  Serial.printf("  Offset: %.3f\n", ph_cal.offset);
  if (ph_cal.num_points >= 1) {
    Serial.printf("  Point 1: pH %.2f @ %.3fV\n", ph_cal.point1_ph, ph_cal.point1_voltage);
  }
  if (ph_cal.num_points >= 2) {
    Serial.printf("  Point 2: pH %.2f @ %.3fV\n", ph_cal.point2_ph, ph_cal.point2_voltage);
  }

  Serial.println("\nTDS Sensor:");
  Serial.printf("  Calibrated: %s\n", tds_cal.is_calibrated ? "YES" : "NO");
  Serial.printf("  Points: %d\n", tds_cal.num_points);
  Serial.printf("  Slope: %.4f\n", tds_cal.slope);
  Serial.printf("  Offset: %.2f ppm\n", tds_cal.offset);
  if (tds_cal.num_points >= 1) {
    Serial.printf("  Point 1: %.0f ppm @ %.3fV\n", tds_cal.point1_tds, tds_cal.point1_voltage);
  }
  if (tds_cal.num_points >= 2) {
    Serial.printf("  Point 2: %.0f ppm @ %.3fV\n", tds_cal.point2_tds, tds_cal.point2_voltage);
  }

  Serial.println("========================\n");
}

