Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
// ============================================================
//  Setup
// ============================================================
void setup() {
  Serial.begin(115200);
  delay(1000);

  // Build topic and client ID
  snprintf(mqtt_topic, sizeof(mqtt_topic), "rack/%d/data", RACK_ID);
  snprintf(client_id, sizeof(client_id), "esp32-rack-%d", RACK_ID);
  snprintf(cmd_Topic,      sizeof(cmd_Topic),      "rack/%d/cmd",     RACK_ID);
  snprintf(ack_cmd_Topic,  sizeof(ack_cmd_Topic),  "rack/%d/cmd/ack", RACK_ID);
  snprintf(signin_topic, sizeof(signin_topic), "device/%d/register", RACK_ID);
  snprintf(signin_ack, sizeof(signin_ack), "device/%d/register/ack", RACK_ID);

  Serial.println("╔══════════════════════════════════════╗");
  Serial.println("║  🌱 ESP32 Rack Sensor — Calibrated   ║");
  Serial.printf( "║  Rack ID: %d                          ║\n", RACK_ID);
  Serial.printf( "║  Topic:   %s      ║\n", mqtt_topic);
  Serial.println("╚══════════════════════════════════════╝");

  // Load calibration data from Preferences
  loadCalibrationData();

  // Begin sensors
  Wire.begin(SDA_PIN, SCL_PIN);
  luxmeter.begin();
  watertemp.begin();
  pinMode(PH_PIN, INPUT);
  pinMode(TDS_PIN, INPUT);

  // Connect
  mqtt.setServer(MQTT_SERVER, MQTT_PORT);
  mqtt.setCallback(callBack);
  connectWiFi();
  connectMQTT();
}

// ============================================================
//  Main loop
// ============================================================
void loop() {
  // Ensure connections
  connectWiFi();
  if (!mqtt.connected()) connectMQTT();
  mqtt.loop();

  if (!isRegistered) {
    registerDevice();
  } else {
    // Send data at interval
    if (millis() - lastSend >= SEND_INTERVAL) {
      lastSend = millis();

      // Build JSON payload
      StaticJsonDocument<256> root;
      root["mac_addr"] = mac_addr;
      JsonObject data = root["data"].to<JsonObject>();
      generateData(data);

      char payload[300];
      serializeJsonPretty(root, payload);
      Serial.println("JSON Payload:");
      Serial.println(payload);
      Serial.println();

      // Publish to MQTT
      if (mqtt.publish(mqtt_topic, payload)) {
        Serial.println("✅ Publish success");
      } else {
        Serial.println("❌ Publish failed!");
      }
    }
  }
}